import { Injectable } from "@angular/core";
import { StringTools } from "babylonjs";
import { Book } from "../home/home.component";

@Injectable({
    providedIn: 'root'
})
export class BookDetailService {

    books = [] as bookDetail[];

    constructor() {
        this.books = [
            {
                id: 1,
                title: 'سمفونی مردگان',
                imageUrl: '/assets/images/book-cover-001.jpg',
                price: 10800000,
                information: [
                    { title: 'کد کالا:', value: '32643' },
                    { title: 'شابک:', value: '9789643113445' },
                    { title: 'نویسنده :', value: 'عباس معروف' },
                    { title: 'انتشارات :', value: 'ققنوس' },
                    { title: 'موضوع :', value: 'داستان های فارسی قرن 14' },
                    { title: 'زبان :', value: 'فارسي' },
                    { title: 'جلد :', value: 'نرم' },
                    { title: 'قطع :', value: 'رقعی' },
                    { title: 'تعداد صفحه :', value: '350' },
                    { title: 'طول :', value: '21' },
                    { title: 'عرض :', value: '14' },
                    { title: 'وزن :', value: '392 گرم' }
                ],
                description: "درباره کتاب: سمفونی مردگان داستان زندگی یک خانواده است که در اردبیل در اواخر سلطنت رضا شاه زندگی می کنند. کتاب از ۴ فصل تشکیل شده که هر فصل از زبان یک راوی نقل می شود. پدر خانواده «جابر اورخانی» مغازه آجیل و خشکبار فروشی در بازار اردبیل دارد. بچه هایش به ترتیب یوسف، آیدین و آیدا ، و اورهان هستند که دخترش آیدا، با آیدین دوقلوست. اورهان که بیشتر از سایرین به پدر در اداره مغازه کمک می کند، مورد علاقه اوست و مادر آیدین را بیش از فرزندان دیگرش دوست دارد. آیدین علاقه بسیاری به درس و مطالعه دارد و اورهان بیشتر به کسب و کار علاقمند است. منزل خانواده اورهانی نزدیک پنکه سازی لرد قراردارد. با اوج گیری جنگ جهانی دوم، دولت روس به بخش های شمالی کشور از جمله آذربایجان حمله هوایی می کند و چتر باز پیاده می کند. این مسئله موجب بروز هرج و مرج در شهر می شود. آشفتگی و ناامنی و کمبود ارزاق، بویژه نان در شهر حاکم می شود. جابر دوستی دارد به نام ایاز که پاسبان است. جابر در بیشتر امور زندگی ایاز را طرف شور و مشورت قرار می دهد. یوسف که در این زمان یک پسر بچه است، تحت تاثیر فضای جنگی حاکم بر شهر در خانه، ادای سربازها را در می آورد مخصوصاً محو تماشای چتر بازها می شود. یک روز هم به تقلید از چتر بازها، چتر بزرگ و سیاه پدر را برمی دارد و با آن از بام خانه پرواز می کند. اما در اثر سقوط از پشت بام، یوسف به نوعی عقب افتادگی دچار می شود. قوای تکلم و شنوایی اش به مرور از بین می رود و چیزی می شود بین آدم و حیوان که مدام می بلعد و خود را کثیف می کند . ایاز که به شدت طرفدار رضا شاه است از کناره گیری او از سلطنت به نفع پسرش، به گریه می افتد و جابر را نیز به گریه می اندازد. در خانواده، اورهان و یوسف کم کم با پدر در اداره مغازه کمک می کنند، اما آیدین علاقه ای به کار آجیل فروشی ندارد. نثر داستان خیلی روان و داستانش خیلی منظم است. داستان کتاب آنقدر جذاب است که اصلا دوست نداری کتاب رو زمین بذاری و استراحت کنی. به دوستان عزیز توصیه می کنم اگه وقتشو داشتند حتماً این کتاب رو بخونند. عباس معروفی در سال ۱۳۳۶ شمسی در تهران متولد شد. فارغ التحصیل هنرهای زیبای تهران در رشته هنرهای دراماتیک است و حدود یازده سال معلم ادبیات در دبیرستان های تهران بوده است.معروفی به خاطر موضع گیری علیه حکومت ایران بارها بازجویی شد و سرانجام تحت فشار سیاسی از ایران خارج شد و به آلمان رفت و هم اکنون ساکن برلین است. سمفونی مردگان برنده جایزه «بنیاد انتشارات ادبی فلسفی سور کامپ» در سال ۲۰۰۱ شده و به دو زبان انگلیسی و نیز آلمانی ترجمه و چاپ شده است. ضمن اینکه در سال ۲۰۰۷ به عنوان یکی از صد رمان برجسته سال بریتانیا انتخاب شد."
            },
        ]
    }

    getDetail(id: number) {
        return this.books.find(e => e.id == id);
    }
}

export class bookDetail {
    constructor() {

    }

    id: number = 0;
    title: string = '';
    imageUrl: string = '';
    price: number = 0;
    description: string = '';
    information: { title: string, value: string }[] = [];
}